data = {
    "FiNER": {
        "text": "魏哲家與台積電董事長劉德音同為張忠謀下一代接班人，但台積電的對外發言及宣傳，幾乎是以劉德音為主，魏哲家更多的是對於上下供應鏈、品牌客戶、投資法人的溝通和聯繫，這回魏哲家則首度大規模的公開自己的經營態度、以及對近一兩年政治及產業時局轉變的觀察及看法，有別於過往法說會時只交代業績、展望，以及公司因應策略的既定模式；更有別在自家技術論壇時，只講進程及佈局的工程師形象，取而代之的是對世局侃侃而談、且不時幽默風趣的魏哲家。 ",  # noqa E501
    },
    "FinRE": {
        "text": "百威英博收购A-B公司，所产生的债务，將透過出售青啤股权來支付。",
        "head": "A-B公司",
        "tail": "百威英博",
        "labels": [
            "unknown",
            "注資",
            "擁有",
            "糾紛",
            "自己",
            "增持",
            "重組",
            "買資",
            "簽約",
            "持股",
            "交易",
            "入股",
            "轉讓",
            "成立",
            "分析",
            "合作",
            "幫助",
            "發行",
            "商討",
            "合併",
            "競爭",
            "訂單",
            "砍單",
            "減持",
            "合資",
            "收購",
            "借殼",
            "欠款",
            "被發行",
            "被轉讓",
            "被成立",
            "被注資",
            "被持股",
            "被擁有",
            "被收購",
            "被幫助",
            "被借殼",
            "被買資",
            "被欠款",
            "被增持",
            "擬收購",
            "被減持",
            "被分析",
            "被入股",
            "被擬收購",
            "被重組",
            "被下訂單",
            "被砍單",
        ],
    },
    "EventTriplet": {
        "text": "魏哲家與台積電董事長劉德音同為張忠謀下一代接班人，但台積電的對外發言及宣傳，幾乎是以劉德音為主，魏哲家更多的是對於上下供應鏈、品牌客戶、投資法人的溝通和聯繫，這回魏哲家則首度大規模的公開自己的經營態度、以及對近一兩年政治及產業時局轉變的觀察及看法，有別於過往法說會時只交代業績、展望，以及公司因應策略的既定模式；更有別在自家技術論壇時，只講進程及佈局的工程師形象，取而代之的是對世局侃侃而談、且不時幽默風趣的魏哲家。 ",  # noqa E501
    },
    "MultiLabel": {
        "CNYES_INDUSTRY": {
            "text": "魏哲家與台積電董事長劉德音同為張忠謀下一代接班人，但台積電的對外發言及宣傳，幾乎是以劉德音為主，魏哲家更多的是對於上下供應鏈、品牌客戶、投資法人的溝通和聯繫，這回魏哲家則首度大規模的公開自己的經營態度、以及對近一兩年政治及產業時局轉變的觀察及看法，有別於過往法說會時只交代業績、展望，以及公司因應策略的既定模式；更有別在自家技術論壇時，只講進程及佈局的工程師形象，取而代之的是對世局侃侃而談、且不時幽默風趣的魏哲家。 ",  # noqa E501
            "labels": [
                "汽車工業",
                "光電業",
                "證券業",
                "保險業",
                "電機機械",
                "觀光事業",
                "造紙工業",
                "化學工業",
                "電子通路業",
                "貿易百貨業",
                "其他電子業",
                "半導體業",
                "橡膠工業",
                "資訊服務業",
                "文化創意業",
                "航運業",
                "其他業",
                "存託憑證",
                "電器電纜",
                "鋼鐵工業",
                "ETN",
                "建材營造業",
                "農業科技業",
                "通信網路業",
                "電子零組件業",
                "食品工業",
                "金控業",
                "玻璃陶瓷",
                "電子商務",
                "ETF",
                "紡織纖維",
                "生技醫療業",
                "油電燃氣業",
                "水泥工業",
                "銀行業",
                "塑膠工業",
                "電腦及週邊設備業",
            ],
        },
        "MONEYDJ_CONTENT": {
            "text": "魏哲家與台積電董事長劉德音同為張忠謀下一代接班人，但台積電的對外發言及宣傳，幾乎是以劉德音為主，魏哲家更多的是對於上下供應鏈、品牌客戶、投資法人的溝通和聯繫，這回魏哲家則首度大規模的公開自己的經營態度、以及對近一兩年政治及產業時局轉變的觀察及看法，有別於過往法說會時只交代業績、展望，以及公司因應策略的既定模式；更有別在自家技術論壇時，只講進程及佈局的工程師形象，取而代之的是對世局侃侃而談、且不時幽默風趣的魏哲家。 ",  # noqa E501
            "labels": [
                "頭條新聞",
                "MoneyDJ社論",
                "總體經濟",
                "國際股市",
                "台股",
                "深滬港股",
                "亞股",
                "美股",
                "歐股",
                "基金",
                "期權",
                "商品原物料",
                "外匯市場",
                "債券市場",
                "產業情報",
                "金融市場",
                "科技脈動",
                "研究報告",
                "市場短波",
                "時事要聞",
            ],
        },
    },
    "FinSent": {
        "text": "魏哲家與台積電董事長劉德音同為張忠謀下一代接班人，但台積電的對外發言及宣傳，幾乎是以劉德音為主，魏哲家更多的是對於上下供應鏈、品牌客戶、投資法人的溝通和聯繫，這回魏哲家則首度大規模的公開自己的經營態度、以及對近一兩年政治及產業時局轉變的觀察及看法，有別於過往法說會時只交代業績、展望，以及公司因應策略的既定模式；更有別在自家技術論壇時，只講進程及佈局的工程師形象，取而代之的是對世局侃侃而談、且不時幽默風趣的魏哲家。 ",  # noqa E501
        "labels": ["正面", "中立", "負面"],
    },
}

prompts = {
    "ner": {
        "zh_desc": "",
        "en_desc": "",
        "zh_one_prompt": "%s。請用中文列出上述提到的所有組織(ORGANIZATION)、公司(COMPANY)、股票(STOCK)、人物(PERSON)、國家(GPE)、地點(LOCATION)、產品(PRODUCT)、產業(INDUSTRY)、法律(LAW)實體:",
        "zh_prompt": "",
        "en_prompt": "",
        "old_zh_prompt": [
            """文本: %s
            請從 `文本` 中列出所有組織(ORGANIZATION)實體:
            """,
            """文本: %s
            請從 `文本` 中列出所有股票或公司(STOCK/COMPANY)實體:
            """,
            """文本: %s
            請從 `文本` 中列出所有人物(PERSON)實體:
            """,
            """文本: %s
            請從 `文本` 中列出所有國家(GPE)實體:
            """,
            """文本: %s
            請從 `文本` 中列出所有地點(LOCATION)實體:
            """,
            """文本: %s
            請從 `文本` 中列出所有產品(PRODUCT)實體:
            """,
            """文本: %s
            請從 `文本` 中列出所有產業(INDUSTRY)實體:
            """,
            """文本: %s
            請從 `文本` 中列出所有法律(LAW)實體:
            """,
        ],
    },
    "re": {
        "zh_desc": "請從下列選項中，選出文本所描述兩間公司之間的關係，關係可能不只一種。選項: %s\n",
        "en_desc": "",
        "zh_one_prompt": "%s。請從選項 %s 中，選出 %s 對 %s 的關係，不用解釋原因：",
        "zh_prompt": "文本: %s\n%s 對 %s 的關係是: %s\n###\n文本: %s\n%s 對 %s 的關係是: %s\n###\n文本:",
        "old_prompt": [
            """請從 `選項` 中，選出 `文本` 所描述 %s 對 %s 的關係 (關係可能不只一種)。
            文本: %s
            因此 %s 對 %s 的關係是:
            """,
            """請依照 `文本` 的語意，從 `選項` 中選出「正確」的句子。
            文本: %s
            選項:
            (A) %s %s %s
            (B) %s 被 %s %s
            (C) 以上都正確
            所以正確的選項是:
            """,
        ],
    },
    "ee": {
        "zh_desc": "",
        "en_desc": "",
        "zh_one_prompt": "%s。請用中文列出上述提到的所有事件:",
    },
    "multilabel": {
        "zh_desc": "",
        "en_desc": "",
        "zh_one_prompt": "%s。請從標籤選項 %s 中，選出符合文章的產業類別標籤，可能有多個標籤符合，只能回答選項中有的:",
    },
    "sentiment": {
        "zh_desc": "請從下列選項中，選出文本所描述是 正面、負面、中立 哪一種情緒。選項: [正面,負面,中立]\n",
        "en_desc": "Choose the most possible sentiment for the text. Sentiment classes: ['positive','negative','neutral']\n",
        "zh_one_prompt": "請問這段文字的情緒是「正面、負面、中立」哪一種:",
        "zh_prompt": "文本: %s\n情緒: %s\n###\n文本: %s\n情緒: %s\n###\n文本: %s\n情緒:",
        "en_prompt": "text: %s\nsentiment: %s\n###\ntext: %s\nsentiment: %s\n###\ntext: %s\nsentiment:",
        "old_prompt": [
            """文本: %s
            請判斷 `文本` 中的描述是 正面、負面、中立 哪一種情緒:
            """,
            """文本: %s
            請說明你判斷 `文本` 的情緒是 %s 的原因:
            """,
        ],
    },
    "aspect_bases_sentiment": {
        "zh_desc": "",
        "en_desc": "",
        "old_prompt": [
            """文本: %s
            請從 `文本` 中列出所有正面情緒的實體:
            """,
            """文本: %s
            請從 `文本` 中列出所有中立情緒的實體:
            """,
            """文本: %s
            請從 `文本` 中列出所有負面情緒的實體:
            """,
        ],
    },
    "summarize": {
        "zh_one_prompt": "%s。請將上述文章摘要成三句話:",
    },
}
